{"pages":[],"posts":[{"title":"知識焦慮？先搞清楚自己想要什麼","text":"為了追求自身效率的成長，買了很多有關增進工作效率、如何思考、要怎麼做才可以變厲害的書，不知不覺書架上、書桌上有一半都是這種類型的書，不過知識吸收的效率沒有增長，書架上的書卻越積越多。 如果你每天下班回家後，想著： 今天上班好累喔～先來放鬆一下！ 於是坐在沙發上捧著香噴噴的晚餐一邊配著電視劇，吃飽後轉移陣地，改躺在床上繼續看劇滑手機玩遊戲，接著洗洗睡，可能睡前會想說： 阿！我今天都沒有好好的做事，來規劃一下好了。 接著拿出一支筆一張白紙，洋洋灑灑的寫好寫滿，想著： 今天的我真棒～有規劃出接下來要做的事，明天開始認真執行吧！ 就這樣安心的睡了，隔天下班後還是感覺上班很累，大腦自動導航到和前一天一模一樣的生活模式，日復一日年復一年。 忽然回頭看著書架上滿滿的書，滿心疑惑，為什麼我買了這麼多書還是沒有變厲害？ 廢話啊！你每天只看劇，會變厲害才奇怪！ 以上就是平常懶散的我真實的生活寫照。 不了解，所以想擁有看著書架上的那些書，咦！這幾本好像講的是一樣的主題，另外這幾本好像講的也是相同的另一個主題，為什麼我要持續購買同一種主題的書呢？ 仔細回想一下，每次逛書店看到書架上的書當下的那種心情，以及買入這本書時心情的轉變： 逛書店的時候想的是：這本書 看起來很有趣，很想要了解 這個領域的知識。 買入時感覺的是：買了這本書後 好像我就擁有了 這本書裡面的全部知識。 於是就因為我 好像擁有了這本書的知識，買完書後反而對這本書提不起興致翻閱，就這樣，這本書被塵封在書櫃的一角。 下次逛書店時，又重複相同的循環： 不了解 → 想擁有它 → 購入相同類型書籍 → 提不起興致翻閱 。 只留下適合自己的書因緣際會開始了解 斷捨離 這個領域，陸續看了幾本斷捨離相關的書籍、影片，下定決心要開始整理我的書。先將書籍按照類型分類，相似主題的書籍分成一堆，算了一下每一堆都有六七本以上，原來上面的恐怖循環已經重複過這麼多次了⋯⋯。 翻閱一下目錄，把 現在的自己已經不需要的書賣掉，可能是在那個時期對迷茫的人生感到困惑而買下、以前很喜歡的作家寫的書、看了就會瘦 10 公斤的書等等。 只留下看到書本介紹還會感到心動、想立刻翻閱的書。 拜現在科技發達所賜，賣書也有很多管道，不需要再去找實體二手書店，我通常都會把已經看過且確定近幾年不需要再看第二次的書上架在 讀冊生活 二手書上架專區，雖然會被平台抽 30% 販售所得，不過蠻適合懶人賣家（我本人）。 平台會負責錄製書況影片以及買家下訂書籍後的收款、包裝、出貨等手續，賣家只需要上架書籍、把書寄到讀冊生活，上架後偶爾因應情況調整一下價格，之後就等待書本賣出入帳即可。大部分想買賣二手書的人都會來這邊逛逛，是一個買賣二手書很方便的平台。 如果遇到無法上架到讀冊生活的書，可能是因為太多人賣導致這本二手書庫存太多，或是書籍年代太過久遠，通常這類型的書比較不好賣，我會改上架到 蝦皮賣場 ，平台只會抽取 2% 的販售所得，不過需要自行拍攝書本的照片影片，設定書本的標題、介紹，以及處理後續買家下訂書籍後的收款、包裝、出貨等等。 開心的是到目前為止已經賣掉了近五十本書，繼續努力！ 設定目標再回頭看看，這幾年訂下的年目標，每年都會有一項是： 看完 10 本書，好像沒有很難，第一年有成功看了 11 本，於是第二年想說試著提高目標吧！設定：看完 30 本書 ，實驗證明，過高的目標會讓自己擺爛，於是這一年只看了 9 本書，連第一年設定的門檻都沒有達到。 今年試著降低設定的目標，改成以月為單位：每個月讀 2 本書，到第九週為止（三月初）已經看了 6 本書，我想這應該是個好的開始吧！ 購入新的書籍前會再三思考整理掉不適合現在自己的書，也能更清楚現在的自己想讀的、想學的內容是什麼。 當書架上的書不再滿到爆出來（立著的擺完後上方又一大疊橫躺的），也就更容易找到心動的書，隨時抽出來閱讀也很方便。當你開始閱讀、開始了解想學習的這個領域，逛書店時也比較不容易衝動的購入相同類型的書。 看到想買的書結帳前會再三思考， 這本書真的是我想要的嗎？買回去我會立刻翻開來看嗎？ 確認真的很想了解裡面的內容時才會慎重的購入這本書，回家仔細翻看。 每天睡前看一頁書些微的調整一下睡前的行動，原先睡前會充分享受自己一天中最後的一小段時間，滑滑手機、玩玩遊戲，改用書本替代，關燈前看一頁即可。 為什麼只設定看一頁就好呢？ 設定目標的大小不重要，重要的是 持之以恆，當你看得意猶未盡，一天兩三頁十幾頁就看過去了，不想看的時候就維持一天只看一頁，嘗試一週後你就會發現，這本書好像差不多要看完了！（1 - 1.5 公分厚的書，太厚的一週只有睡前看可能有點難度） 只要每天花一點點時間，就可以完成，只要從 小目標開始行動。","link":"/figure-out-what-you-want/"},{"title":"hexo 部落格建立 part2","text":"本篇文章將說明：4. 安裝 hexo 主題 minos5. 客製化網域名稱設定6. Cloudflare SSL 免費憑證設定 安裝 hexo 主題 minos在自己的專案資料夾底下把主題包 git clone 下來並放置到主題資料夾底下 12cd ~&#x2F;github&#x2F;elliesu_bloggit clone https:&#x2F;&#x2F;github.com&#x2F;ppoffice&#x2F;hexo-theme-minos.git themes&#x2F;minos 使用 2.4.0 版本(安裝當時最新版)，並把 minos 主題加為專案的子模組(也可以選擇不加) 12git checkout 2.4.0git submodule add https:&#x2F;&#x2F;github.com&#x2F;ppoffice&#x2F;hexo-theme-minos.git themes&#x2F;minos 複製主題資料夾底下的 _config.yml.example 檔案，並把檔名更改為 _config.yml 1cp themes&#x2F;minos&#x2F;_config.yml.example themes&#x2F;minos&#x2F;_config.yml 將此專案的 _config.yml 主題更新為 minos，注意！是此專案的 _config.yml，不是 minos 資料夾內的喔！ 1theme: minos 現在就可以試著預覽看看網站的新衣吧！ 1hexo server 遇到問題一: ERROR Package hexo-renderer-sass is not installed.ERROR Please install the missing dependencies in the root directory of your Hexo site. 解決: minos 有使用 hexo-renderer-sass 套件，需要另外安裝在主資料夾底下 1npm install --save hexo-renderer-sass 遇到問題二: ERROR Package cheerio is not installed.ERROR Please install the missing dependencies in the root directory of your Hexo site.解決: minos 有使用 cheerio 套件，需要另外安裝在主資料夾底下 1npm install cheerio 主題相關設定可參考 Configuring Minos minos 主題 _config.yml 調整 設定 logo 名稱 關閉分享功能 關閉留言功能123456789101112logo: text: Ellie's Note# Share plugin settings.share: # type: sharethis # install_url:# Comment plugin settings.comment: # type: disqus # shortname: 客製化網域名稱設定 如果你的網域名稱不需要客製化的話，每個 GitHub 帳號都會有一個免費的 GitHub Pages 可以使用，但只能用於靜態網站，使用方式很簡單，只需要前往自己的 Git Repository -> Setting -> GitHub Pages 設定要發布的分支即可現在可以試著用 https://[your_account].github.io/[your_repository] 進入這個靜態網站 客製化網域名稱首先須先準備一個購買好的網域，這邊使用 Godaddy 購買 一樣是在 Git Repository -> Setting -> GitHub Pages -> Custom domain 填上自訂網域 使用 hexo 框架的話，需在專案的 source 資料夾下新增檔案 CNAME 12cd sourcetouch CNAME CNAME 檔案內容 1elliesu.com 到自己的網域商（這邊使用 Godaddy）選擇 網域 DNS 管理，新增類型 A，名稱(主機) 填 @ 表示自己，指向 GitHub 主機 185.199.108.153，TTL 設為 600 秒這邊 CNAME 可新增 www 也可不新增，www.elliesu.com 預設會指向 elliesu.com 可於終端機執行下列命令 123dig www.elliesu.com +nostats +nocomments +nocmddig elliesu.com +nostats +nocomments +nocmd 未於 Godaddy 設定前顯示如下，此時進入 elliesu.com 會導向 Godaddy 於 Godaddy 設定後，後續又新增另外三個 GitHub 主機，顯示如下 使用 dig 指令檢視網域狀態，皆已成功連結 檢視 www.elliesu.com 狀態 Github 原先的 DNS Server IP: 192.30.252.153、192.30.252.154後來可能是因為 Github 被微軟買走，主機跟著遷徙，導致主機的 ip 位置也跟著改所以 ip 改為: 185.199.108.153、185.199.109.153、185.199.110.153、185.199.111.153 前面設定 DNS 時有看到一個名稱叫做 TTL，它是什麼呢？ 存留時間 TTL 是 DNS 紀錄中用來定義 DNS 紀錄的後續變更生效前的秒數。在您的網域中，每個 DNS 紀錄（例如 MX 紀錄、CNAME 紀錄等）都具有 TTL 值，其決定了您對紀錄所做的變更需要多久才會生效。舉例來說，如果一個紀錄的 TTL 為 86400 秒，則變更將需要 24 小時才會生效 請注意，變更任一紀錄的 TTL 將影響「往後」任何變更生效所需要的時間。建議您將 TTL 值設定為 3600，告知網路上的伺服器每小時檢查更新紀錄。這意味著當您下次更新紀錄，您的變更將會在一小時後生效。如要縮短往後變更生效所需的時間（比如您想要儘快還原某個變更），您可以設定較短的 TTL，例如 300 秒（5 分鐘） DNS 記錄類型 Cloudflare SSL 免費憑證設定目前我們已經成功客製化網域名稱了，如果你需要將你的網站更改為 https，則需要使用 SSL 憑證，以下使用 Cloudflare 註冊 Cloudflare 輸入網域名稱，Cloudflare 會偵測到目前的設定，點選左下角 Continue -> 選擇 Default method，按照 Cloudflare 步驟修改 進入 Godaddy 網域管理頁面，變更網域名稱伺服器 -> 輸入我自己的名稱伺服器(進階)，將步驟 2 中 Cloudflare 提供的伺服器名稱貼入，設定完成後，Godaddy 會顯示下列畫面 回到 Cloudflare，點選 re-checked，等待 Cloudflare 成功偵測到網域伺服器名稱已變更，約需三至五分鐘 設定 Cloudflare SSL，上排選單選擇 SSL/TLS，選擇 Full 設定網域名稱強制導向 HTTPS，上排選單選擇 Page Rules -> Create Page Rules，這邊可以免費設定三個網域，設定 elliesu.com 即可，因為 CNAME www.elliesu.com 有設定導向 @，也就是自己這個網域，所以從 http://www.elliesu.com 進入網站，會導向 elliesu.com，而 elliesu.com 有強制導向 HTTPS，所以只需要設定一個網域即可 ReferenceMinos 主題Managing a custom domain for your GitHub Pages siteTroubleshooting custom domains and GitHub PagesGoogle DNS 基本資訊Godaddy 官方網域說明How do I redirect all visitors to HTTPS/SSL?","link":"/build-hexo-blog-part-2/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/hello-world/"},{"title":"拖延，是一種病？","text":"為什麼身旁的人行動力總是這麼強？難道他們背後有個蓋子打開裡面裝很多顆金頂電池？ 因為他們 想到就去做 ，不會累積長長的待辦清單。並非不列待辦清單，而是他們會快速消化掉待辦清單上的項目，在你我滑手機看影片的時候。 你現在所獲得的成就，是取決於兩年前的你所做的努力。 在靈感的泉源——廁所閱讀文件，在下班後放飛自我時學習新技能，在人擠人的連續假期完成專案。 這些人忍人所不能忍，披荊斬棘上刀山下油鍋就為了一份文件、一個技能、一個專案？ 只不過是 延遲享樂 而已。試著 捨棄現在的快樂，把自己投入到學習中，不需要很複雜的規劃，放下你的手機，先開始就對了！ 「等一下」再做，等於什麼都不會做拖延的人常會想： 現在 20:52，我再滑 8 分鐘的手機就去讀書。滑著滑著，20 分鐘就過去了。 21:12 看著時間：天啊滑超過時間！可是這個好好看，那我再滑 3 分鐘關掉。又 15 分鐘過去。 上面這個情境，是不是似曾相識呢？每天都會上演在你我的生活中，殘酷的現實是： 現在的你和拖延一小時後的你能力是相同的。 不要認為一小時後的你效率會超好，現在不做，以後也不會做了，把握當下的人生，離開舒適圈吧！ 只要每天踏出小小一步今天比昨天多學到一個知識、今天比昨天多寫一句話、今天比昨天多做一下挺身。相較於昨天的自己，今天的我更厲害呢！ 不一定是很艱深的知識、詞藻華麗的語句、姿勢一百分的動作，就只是，比昨天的自己厲害一點點、進步一點點，每天的這一點點，最後會成為大大的一點！ 放下你的完美，就連神也很難十全十美如果專注於想要完美達成，很可能什麼事情都做不成，導致惡性循環，最後放棄。 嚴格遵守時間 大於 完成成果的品質 ，比起遲交但完美的完成成果，在時間內交出差強人意的成果更能令人接受。先有一個初版，再對其進行改善。 不用完美到 100%，我們 只需要做好 80%，剩下的 20% 可以適時留白，讓自己放鬆放鬆吧！小缺點也是一種美！ 減法哲學將想做的事減少為三個以內，只做令自己心動的事，並且 不要增加想做的事 。 說做就做的關鍵在於「快樂」 把自己放在只能做這件事的環境中。 設定定時器：可以從 5 - 10 分鐘開始計時，在時限內嘗試做這件事。 記錄自己時限內可以完成多少事，進而去預估工時、任務難易度。 正確預測工時、難易度可以提高做這件事的動力。 累積成功的經驗。 產生快樂。 讓自己在這個正向循環裡 快樂的完成，你就會在這個循環裡 感到快樂！ 如果上述方法都失敗了… 試著做 失敗記錄 ：試著覺察失敗的當下，每當拖延就記錄下來，避免無意識拖延 → 練習產生自覺。 預估最大的損失：現在如果不做這件事， 最嚴重的後果是什麼？ex: 現在不努力進修學習新技能、增加自身能力，幾年後的你就會失去競爭力。ex: 現在繼續一直看劇滑手機，你的人生也只剩下這些劇和手機。 分析不想做的最大理由，為什麼無法說做就做：卡在下列哪一個階段？ 無法做選擇 → 試著從鎖定一個目標開始。 無法決定是否做這件事 → 確認自己是否真的有決心做這件事。 沒做好準備 → 事前準備是必要的步驟。 無法實行 → 查看上述方法尋找可能的原因。ex: 環境、壓力、沒做好預估。 source 放在書櫃裡好久的書《再見，拖延病！》 拖延如我，終於看完此書，僅以此文紀念這感動的一刻！拖延是病，本書是很好的處方籤，對症下藥，馬上有效！","link":"/procrastination/"},{"title":"你不理財，財不理你","text":"前幾天和友人吃飯聊到被動收入、財務自由，這個我耳濡目染好一段時間的名詞，才發現到原來我已經不是當初對理財一竅不通的小白，時不時會計算自己若需要達成財務自由，存多少錢才夠？目前存到什麼進度？看著存款金額慢慢增加，也更有動力持續下去。 大約在兩年半前，和同事一起加入健身房，每月付著一千多元的會費，那時候連 緊急備用金 是什麼？可以吃嗎？都不知道。 曾經因為被推銷健身房教練課程導致負債。當時的自己也不太懂得拒絕，原本買一期的課程還在我的負擔金額內，後來被推銷第二期課程時，被話術和自己的貪心矇了眼，想說課程買多比較便宜，信用卡就這樣刷下去，根本沒有考慮到總金額高昂且當時是在沒有存款的情況下。 想著天塌下來還有家裡頂著，在付信用卡費時想著不要繳到循環利息，硬著頭皮去和家裡借錢，開始了我的負債人生。 比起大多數負債的人，我的故事大概就像是媽寶吵著要糖吃。但更重要的是，當時的我從來不覺得存不到錢是因為自己的消費習慣，只覺得薪水不高存不到錢很正常。 學習理財從記帳開始有些人覺得每日記帳等於理財，但是沒有對記錄下來的資料加以分析，還不如不要花時間記錄。我一直都有記帳的習慣，不過大多時候都流於形式，像個機器人一樣，花錢、記錄、花錢、記錄，如此往復，每個月還是存不到錢。記帳的目的是 為了瞭解自己的消費習慣、每月開銷，進而去估算每個月預計花費的金額，而不是一領到收入就大手大腳的花，到月底時只能啃土。 當你可以明確地計算出你的 每月基本開銷 ，這時候才比較容易估算其他項目。 每月基本開銷大致有以下幾項： 基本伙食費 交通費 房租 (住家裡則不須計算) 電話費 日用品 緊急備用金是最重要的若你還沒有存到一筆緊急備用金，後面的就先不要看了，先存到這筆錢再說吧。 粗略的算法為 6-12 個月的生活費，如果忽然沒有收入或是有什麼其他意料之外的事情發生，至少有一段時間可以不用擔心錢的問題。 先支付自己先支付自己指的並不是當自己想買什麼東西就去買，而是 當獲得收入時，第一件事是先把收入的一部分拿去投資自己的腦袋、購買資產，再來是拿去付各種費用，最後才是生活費。 遵守紀律如果沒有遵循設定好的規則，而是存一個月、花一個月，三天捕魚兩天曬網，那可能會花很久時間才存到你想要的金額。 購入資產，找尋投資標的假設算下來每月基本開銷為 20000 元，若可以找到一個投資報酬率 5% 的投資標的，只要每年可以領到 20000 元的利息，就相當於財務自由。 目前是使用股票作為投資工具，0056 或金融股大約都有 3-5% 的投資報酬率，若將每年領到的股息再投入，則可以加速財務自由的時間。 Note: 投資一定有風險，記得一定要用閒錢投資，不然若是有急用，可能會因此損失利潤。 計算本金這時候問題就來了，到底要存多少的本金才夠呢？ 假設想要每月領到 20000 元，等同於一年需領到 12 x 20000 = 24 萬元 本金即為 24 萬 / 5% = 480 萬元 如果有其他想估算進去的開銷，那金額就會再往上加。 想要不被工作綁架時間？想要把自己的一天投入在更喜歡的事情上？ 那麼， 開始存錢吧！ 越早開始存錢，選擇一個 3-5% 的投資標的，時間就會是你最好的複利工具。","link":"/manage-your-money/"},{"title":"hexo 部落格建立","text":"本篇文章將說明： 如何安裝 hexo hexo 專案建置 將 hexo 加入 Git 版本控管 如何安裝 hexo需安裝： Node.js (建議使用 Node.js 10.0 及以上版本)目前安裝 node.js 版本為 LTS 12.13.1 Git hexo1npm install hexo-cli -g 若安裝 hexo 時顯示以下訊息，表示有權限問題 npm WARN checkPermissions Missing write access to /usr/local/lib/node_modules 使用 sudo 即可，因為 cli 指令會使用到命令列，必須授與權限才可使用-g 表示 global 全域安裝 1sudo npm install hexo-cli -g 安裝 hexo git 一鍵部署，若操作過程顯示下列錯誤訊息可能也表示未安裝此套件 ERROR Deployer not found: git 1npm install hexo-deployer-git --save hexo 專案建置安裝完成後即可切換到自己慣用的工作區，像我的話是 github 資料夾底下 1cd ~&#x2F;github 使用 hexo 方便的內建指令就可一鍵產生專案 123hexo init elliesu_blogcd elliesu_blognpm install Git repository在自己的 github 建立一個新的 repository: elliesu_blog，repository 的名稱要與資料夾名稱相同 回到 hexo 專案內，開啟 _config.yml，設定產生靜態網站並部署時要推送到遠端的 git 位置，也就是剛剛在 github 新開的 repository，repository 路徑規則為 http://github.com/[github_name]/[repository_name].git，要推送的分支設定為 master 1234deploy: type: git repository: http://github.com/EllieSu/elliesu_blog.git branch: master 一鍵部署，d 表示 deploy，-g 表示產生靜態網站 1hexo d -g 推送完成後，到自己的 github 頁面會看到 master 分支的檔案怎麼只剩下靜態的部分？原因是因為 hexo 部署時只會把靜態網站推送至遠端 master，所以遠端的 master 分支只會有專案中靜態網站的資料那要怎麼把專案中其他的資料夾與檔案也加入追蹤呢？很簡單首先，為了不混淆靜態網站與我們平常的編輯模式，我們必須要新增一個分支 hexo 新增並切換分支 hexo，推送編輯模式至遠端 git，這樣就可以成功把編輯模式與部署分離囉 12345git checkout -b hexogit add .git commit -m &quot;first commit&quot;git remote add origin https:&#x2F;&#x2F;github.com&#x2F;EllieSu&#x2F;elliesu_blog.gitgit push -u origin hexo 下一章會介紹如何更換 hexo 主題、自訂網域名稱、SSL 免費憑證設定 ReferenceHexo 文件","link":"/build-hexo-blog-part-1/"}],"tags":[{"name":"斷捨離","slug":"斷捨離","link":"/tags/%E6%96%B7%E6%8D%A8%E9%9B%A2/"},{"name":"知識焦慮","slug":"知識焦慮","link":"/tags/%E7%9F%A5%E8%AD%98%E7%84%A6%E6%85%AE/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"minos","slug":"minos","link":"/tags/minos/"},{"name":"Cloudflare","slug":"Cloudflare","link":"/tags/Cloudflare/"},{"name":"SSL","slug":"SSL","link":"/tags/SSL/"},{"name":"Godaddy","slug":"Godaddy","link":"/tags/Godaddy/"},{"name":"理財","slug":"理財","link":"/tags/%E7%90%86%E8%B2%A1/"},{"name":"財務自由","slug":"財務自由","link":"/tags/%E8%B2%A1%E5%8B%99%E8%87%AA%E7%94%B1/"}],"categories":[]}